logs/benchmark_20250709_211047/h2_50ms_1pct.log
=== HTTP/2 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-09 21:13:46
Delay: 50ms
Loss: 1%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 1: root refcnt 9 limit 1000 delay 150ms loss 1%
qdisc tbf 10: parent 1:1 rate 600Mbit burst 4050b lat 400ms 

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 2000 total requests
spawning thread #1: 5 total client(s). 2000 total requests
spawning thread #2: 5 total client(s). 2000 total requests
spawning thread #3: 5 total client(s). 2000 total requests
spawning thread #4: 5 total client(s). 2000 total requests
spawning thread #5: 5 total client(s). 2000 total requests
spawning thread #6: 5 total client(s). 2000 total requests
spawning thread #7: 5 total client(s). 2000 total requests
spawning thread #8: 5 total client(s). 2000 total requests
spawning thread #9: 5 total client(s). 2000 total requests
spawning thread #10: 5 total client(s). 2000 total requests
spawning thread #11: 5 total client(s). 2000 total requests
spawning thread #12: 5 total client(s). 2000 total requests
spawning thread #13: 5 total client(s). 2000 total requests
spawning thread #14: 5 total client(s). 2000 total requests
spawning thread #15: 5 total client(s). 2000 total requests
spawning thread #16: 5 total client(s). 2000 total requests
spawning thread #17: 5 total client(s). 2000 total requests
spawning thread #18: 5 total client(s). 2000 total requests
spawning thread #19: 5 total client(s). 2000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 475.31ms, 84155.07 req/s, 24.40MB/s
requests: 40000 total, 40000 started, 40000 done, 40000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 40000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 11.60MB (12162457) total, 8.12MB (8517843) headers (space savings 27.81%), 2.29MB (2400000) data
                     min         max         mean         sd        +/- sd
time for request:      936us    100.14ms     82.50ms     19.98ms    89.25%
time for connect:     1.63ms    106.76ms     59.24ms     34.31ms    53.00%
time to 1st byte:    23.83ms    202.49ms    129.74ms     61.01ms    55.00%
req/s           :     862.35     2747.18     1074.17      283.20    88.00%
Waiting 5s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 18000 total requests
spawning thread #1: 5 total client(s). 18000 total requests
spawning thread #2: 5 total client(s). 18000 total requests
spawning thread #3: 5 total client(s). 18000 total requests
spawning thread #4: 5 total client(s). 18000 total requests
spawning thread #5: 5 total client(s). 18000 total requests
spawning thread #6: 5 total client(s). 18000 total requests
spawning thread #7: 5 total client(s). 18000 total requests
spawning thread #8: 5 total client(s). 18000 total requests
spawning thread #9: 5 total client(s). 18000 total requests
spawning thread #10: 5 total client(s). 18000 total requests
spawning thread #11: 5 total client(s). 18000 total requests
spawning thread #12: 5 total client(s). 18000 total requests
spawning thread #13: 5 total client(s). 18000 total requests
spawning thread #14: 5 total client(s). 18000 total requests
spawning thread #15: 5 total client(s). 18000 total requests
spawning thread #16: 5 total client(s). 18000 total requests
spawning thread #17: 5 total client(s). 18000 total requests
spawning thread #18: 5 total client(s). 18000 total requests
spawning thread #19: 5 total client(s). 18000 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 24.81s, 14508.97 req/s, 4.21MB/s
requests: 360000 total, 360000 started, 360000 done, 360000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 360000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 104.53MB (109610717) total, 73.29MB (76845817) headers (space savings 27.78%), 20.60MB (21600000) data
                     min         max         mean         sd        +/- sd
time for request:      408us       1.30s    341.00ms    206.42ms    64.54%
time for connect:     4.67ms    122.80ms     65.48ms     31.51ms    58.00%
time to 1st byte:    42.58ms    751.34ms    378.04ms    211.82ms    54.00%
req/s           :     145.10      148.21      145.52        0.69    84.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/2
Fair Comparison: Enabled
Warmup Requests: 40000
Measurement Requests: 360000
End Time: 2025-07-09 21:14:16
CSV Log: /logs/benchmark_20250709_211047/h2_50ms_1pct.csv